In [1]:
import pandas as pd

url = "https://gist.githubusercontent.com/ahcamachod/807a2c1cf6c19108b2b701ea1791ab45/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv"
df = pd.read_csv(url)

In [2]:
df.head(7)

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   NaN    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True
5    Bruna    23   NaN    False
6  Daniela    21   7.0     True

In [3]:
df.tail()

    Nombre  Edad  Nota   Aprobado
13  Miriam    25   9.0       True
14   Pablo    37   NaN      False
15  Milena    29   7.0       True
16   Lucas    33   NaN      False
17   Nadia    34   8.0  Verdadero

In [4]:
df.shape

(18, 4)

In [5]:
# Visualizar los nombres de las columnas
df.columns

# Seleccionar una columna
df['Nombre']

# Seleccionar múltiples columnas
df[['Edad', 'Nota']]

# Verificar los tipos de datos en cada columna
df.dtypes

Nombre       object
Edad          int64
Nota        float64
Aprobado     object
dtype: object

In [6]:
df.describe()

            Edad       Nota
count  18.000000  12.000000
mean   25.500000   6.841667
std     6.070662   2.264532
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000

1. Verifica si la base de datos contiene datos nulos y, en caso de tenerlos, realiza el tratamiento de estos datos nulos de la manera que consideres más coherente con la situación.

In [8]:
df.isnull()

    Nombre   Edad   Nota  Aprobado
0    False  False  False     False
1    False  False   True     False
2    False  False  False     False
3    False  False  False     False
4    False  False  False     False
5    False  False   True     False
6    False  False  False     False
7    False  False  False     False
8    False  False  False     False
9    False  False   True     False
10   False  False   True     False
11   False  False  False     False
12   False  False  False     False
13   False  False  False     False
14   False  False   True     False
15   False  False  False     False
16   False  False   True     False
17   False  False  False     False

In [16]:
df.fillna(0)

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   0.0      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   0.0      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   0.0      False
10    Danilo    21   0.0      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   0.0      False
15    Milena    29   7.0       True
16     Lucas    33   0.0      False
17     Nadia    34   8.0  Verdadero

In [14]:
df = df.fillna(0)
df.isnull().sum()

Nombre      0
Edad        0
Nota        0
Aprobado    0
dtype: int64

2. Los estudiantes "Alicia" y "Carlos" ya no forman parte del grupo. Por lo tanto, elimínalos de la base de datos.

In [19]:
df.query("Nombre == 'Alicia' | Nombre == 'Carlos'")
df.head(10)

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   0.0    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True
5    Bruna    23   0.0    False
6  Daniela    21   7.0     True
7   Carlos    19   6.0    False
8   Alicia    35   5.6    False
9   Victor    28   0.0    False

3. Aplica un filtro que seleccione solo a los estudiantes que fueron aprobados.

In [22]:
filtro = df["Nota"] >= 7
filtro

0      True
1     False
2     False
3     False
4      True
5     False
6      True
7     False
8     False
9     False
10    False
11    False
12     True
13     True
14    False
15     True
16    False
17     True
Name: Nota, dtype: bool

4. Guarda el DataFrame que contiene solo a los estudiantes aprobados en un archivo CSV llamado "alumnos_aprobados.csv".

In [35]:
filtro.to_csv("alumnos_aprobado.csv", sep=";")

In [36]:
pd.read_csv("alumnos_aprobado.csv")

       ;Nota
0     0;True
1    1;False
2    2;False
3    3;False
4     4;True
5    5;False
6     6;True
7    7;False
8    8;False
9    9;False
10  10;False
11  11;False
12   12;True
13   13;True
14  14;False
15   15;True
16  16;False
17   17;True